/*
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*                                                                             *
*                                M  A  I  N                                   *
*                                                                             *
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*/

/*===========================================================================*/
/*                               INCLUDE FILE                                */
/*---------------------------------------------------------------------------*/
#include "Boss.h"

/*===========================================================================*/
/*                      DEFINITIONS & TYPEDEFS & MACROS                      */
/*---------------------------------------------------------------------------*/

/*===========================================================================*/
/*                             GLOBAL VARIABLES                              */
/*---------------------------------------------------------------------------*/
BOSS_SEM_ID_T ex_sem_id;

int g_count = 0;

/*===========================================================================*/
/*                            FUNCTION PROTOTYPES                            */
/*---------------------------------------------------------------------------*/
void Boss_device_init(void);

/*===========================================================================
    A A _ T A S K
---------------------------------------------------------------------------*/
boss_stk_t aa_stk[ 512 / sizeof(boss_stk_t)];

int aa_task(void *p_arg)
{  
  PRINTF("[세마포어 생성 및 초기화]\n\n");

  ex_sem_id = Boss_sem_create(1);   // sem_max 가 "1" 경우 바이너리 세마포어
  
  for(;;)
  {
    Boss_sleep(1000);  /* ms */

    if( _BOSS_SUCCESS == Boss_sem_obtain(ex_sem_id, 5/*ms*/) )
    {
      PRINTF("[[ 세마포어 (획득) \n");

      g_count++;
      PRINTF("g_count = %d \n", g_count);

      Boss_sem_release(ex_sem_id);
      PRINTF("]] 세마포어 (반환) \n\n");
    }
    else
    {
      PRINTF("세마포어 [타임 아웃 : ERROR] \n");
    }
  }
    
  return 0;       // 테스크 종료
}


/*
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*                         RT-BOSS ( IDLE TASK )                               *
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*/
boss_stk_t idle_stack[ 160 / sizeof(boss_stk_t)];

int idle_task(void *p_arg)
{
  for(;;)
  {
  }
}


/*===========================================================================
    M A I N
---------------------------------------------------------------------------*/
int main(void)
{
  (void)Boss_init(idle_task, _BOSS_NULL, idle_stack, sizeof(idle_stack));
  
  (void)Boss_task_create( aa_task,              /* Task Entry Point       */
                          _BOSS_NULL,           /* Task Argument          */
                          aa_stk,               /* 스택 포인터(base)      */
                          sizeof(aa_stk),       /* 스택 크기(Bytes)       */
                          PRIO_1,               /* 우선순위               */
                          "AA"                  /* 테스크 이름            */
                        );
  

  Boss_device_init();         /* 타이머 초기화 */
  Boss_start();               /* Boss Scheduling Start */
  
  BOSS_ASSERT(_BOSS_FALSE);   /* Invalid */
  return 0;
}


/*
        ########## 실행 결과 ##########

            [세마포어 생성 및 초기화]
            
            [[ 세마포어 (획득) 
            g_count = 1 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 2 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 3 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 4 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 5 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 6 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 7 
            ]] 세마포어 (반환) 

          ------- 중략 -------
*/
