/*
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*                                                                             *
*                                M  A  I  N                                   *
*                                                                             *
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*/

/*===========================================================================*/
/*                               INCLUDE FILE                                */
/*---------------------------------------------------------------------------*/
#include "Boss.h"

/*===========================================================================*/
/*                      DEFINITIONS & TYPEDEFS & MACROS                      */
/*---------------------------------------------------------------------------*/

/*===========================================================================*/
/*                             GLOBAL VARIABLES                              */
/*---------------------------------------------------------------------------*/
boss_sem_t sem_test;

int g_count = 0;

/*===========================================================================*/
/*                            FUNCTION PROTOTYPES                            */
/*---------------------------------------------------------------------------*/
void Boss_device_init(void);

/*===========================================================================
    [ A A _ T A S K ]
---------------------------------------------------------------------------*/
boss_tcb_t    aa_tcb;
boss_align_t  aa_stk[ 512 / sizeof(boss_align_t) ];         /* 512 bytes */

/*===============================================
    A A _ M A I N
-----------------------------------------------*/
int aa_main(void *p_arg)
{  
  PRINTF("[세마포어 초기화]\n\n");

  Boss_sem_init(&sem_test);
  
  for(;;)
  {    
    Boss_sleep(1000);  /* ms */

    if( _BOSS_SUCCESS == Boss_sem_obtain(&sem_test, 5/*ms*/) )
    {
      PRINTF("[[ 세마포어 (획득) \n");

      g_count++;
      PRINTF("g_count = %d \n", g_count);

      Boss_sem_release(&sem_test);
      PRINTF("]] 세마포어 (반환) \n\n");
    }
    else
    {
      PRINTF("세마포어 [타임 아웃 : ERROR] \n");
    }
  }
    
  return 0;
}


/*
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*                         RT-BOSS ( IDLE TASK )                               *
*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*=====*
*/
boss_tcb_t    idle_tcb;
boss_align_t  idle_stack[ 128 / sizeof(boss_align_t) ];     /* 128 bytes */

/*===========================================================================
    I D L E _ M A I N
---------------------------------------------------------------------------*/
int idle_main(void *p_arg)
{
  for(;;)
  {
  }
}


/*===========================================================================
    M A I N
---------------------------------------------------------------------------*/
int main(void)
{
  Boss_init(idle_main, &idle_tcb, (boss_stk_t *)idle_stack, sizeof(idle_stack));
  
  Boss_task_create( aa_main,              /* Task Entry Point       */
                    _BOSS_NULL,           /* Task Argument          */
                    &aa_tcb,              /* TCB(Task Control Block)*/
                    AA_PRIO_1,            /* Priority               */
                    (boss_stk_t *)aa_stk, /* Stack Point (Base)     */
                    sizeof(aa_stk),       /* Stack Size (Bytes)     */
                    "AA"
                    );

  Boss_device_init();
  Boss_start();               /* Boss Scheduling Start */
  
  BOSS_ASSERT(_BOSS_FALSE);   /* Invalid */
  return 0;
}


/*
        ########## 실행 결과 ##########

            [세마포어 초기화]
            
            [[ 세마포어 (획득) 
            g_count = 1 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 2 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 3 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 4 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 5 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 6 
            ]] 세마포어 (반환) 
            
            [[ 세마포어 (획득) 
            g_count = 7 
            ]] 세마포어 (반환) 

          ------- 중략 -------
*/
